analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/gcr_regs.h
#define MXC_F_GCR_RSTR1_AUDIO_POS                      19 /**< RSTR1_AUDIO Position */
#define MXC_F_GCR_RSTR1_AUDIO                          ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_AUDIO_POS)) /**< RSTR1_AUDIO Mask */

#define MXC_F_GCR_RSTR1_I2C2_POS                       20 /**< RSTR1_I2C2 Position */
#define MXC_F_GCR_RSTR1_I2C2                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_I2C2_POS)) /**< RSTR1_I2C2 Mask */

#define MXC_F_GCR_RSTR1_RPU_POS                        21 /**< RSTR1_RPU Position */
#define MXC_F_GCR_RSTR1_RPU                            ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_RPU_POS)) /**< RSTR1_RPU Mask */

#define MXC_F_GCR_RSTR1_HTMR0_POS                      22 /**< RSTR1_HTMR0 Position */
#define MXC_F_GCR_RSTR1_HTMR0                          ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_HTMR0_POS)) /**< RSTR1_HTMR0 Mask */

#define MXC_F_GCR_RSTR1_HTMR1_POS                      23 /**< RSTR1_HTMR1 Position */
#define MXC_F_GCR_RSTR1_HTMR1                          ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_HTMR1_POS)) /**< RSTR1_HTMR1 Mask */

#define MXC_F_GCR_RSTR1_DVS_POS                        24 /**< RSTR1_DVS Position */
#define MXC_F_GCR_RSTR1_DVS                            ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_DVS_POS)) /**< RSTR1_DVS Mask */

#define MXC_F_GCR_RSTR1_SIMO_POS                       25 /**< RSTR1_SIMO Position */
#define MXC_F_GCR_RSTR1_SIMO                           ((uint32_t)(0x1UL << MXC_F_GCR_RSTR1_SIMO_POS)) /**< RSTR1_SIMO Mask */

/**@} end of group GCR_RSTR1_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PERCKCN1 GCR_PERCKCN1
 * @brief    Peripheral Clock Disable.
 * @{
 */
#define MXC_F_GCR_PERCKCN1_BTLED_POS                   0 /**< PERCKCN1_BTLED Position */
#define MXC_F_GCR_PERCKCN1_BTLED                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_BTLED_POS)) /**< PERCKCN1_BTLED Mask */

#define MXC_F_GCR_PERCKCN1_UART2D_POS                  1 /**< PERCKCN1_UART2D Position */
#define MXC_F_GCR_PERCKCN1_UART2D                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_UART2D_POS)) /**< PERCKCN1_UART2D Mask */

#define MXC_F_GCR_PERCKCN1_TRNGD_POS                   2 /**< PERCKCN1_TRNGD Position */
#define MXC_F_GCR_PERCKCN1_TRNGD                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_TRNGD_POS)) /**< PERCKCN1_TRNGD Mask */

#define MXC_F_GCR_PERCKCN1_SCACHED_POS                 7 /**< PERCKCN1_SCACHED Position */
#define MXC_F_GCR_PERCKCN1_SCACHED                     ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_SCACHED_POS)) /**< PERCKCN1_SCACHED Mask */

#define MXC_F_GCR_PERCKCN1_SDMAD_POS                   8 /**< PERCKCN1_SDMAD Position */
#define MXC_F_GCR_PERCKCN1_SDMAD                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_SDMAD_POS)) /**< PERCKCN1_SDMAD Mask */

#define MXC_F_GCR_PERCKCN1_SMPHRD_POS                  9 /**< PERCKCN1_SMPHRD Position */
#define MXC_F_GCR_PERCKCN1_SMPHRD                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_SMPHRD_POS)) /**< PERCKCN1_SMPHRD Mask */

#define MXC_F_GCR_PERCKCN1_SDHCD_POS                   10 /**< PERCKCN1_SDHCD Position */
#define MXC_F_GCR_PERCKCN1_SDHCD                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_SDHCD_POS)) /**< PERCKCN1_SDHCD Mask */

#define MXC_F_GCR_PERCKCN1_ICACHEXIPD_POS              12 /**< PERCKCN1_ICACHEXIPD Position */
#define MXC_F_GCR_PERCKCN1_ICACHEXIPD                  ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_ICACHEXIPD_POS)) /**< PERCKCN1_ICACHEXIPD Mask */

#define MXC_F_GCR_PERCKCN1_OWIRED_POS                  13 /**< PERCKCN1_OWIRED Position */
#define MXC_F_GCR_PERCKCN1_OWIRED                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_OWIRED_POS)) /**< PERCKCN1_OWIRED Mask */

#define MXC_F_GCR_PERCKCN1_SPI0D_POS                   14 /**< PERCKCN1_SPI0D Position */
#define MXC_F_GCR_PERCKCN1_SPI0D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_SPI0D_POS)) /**< PERCKCN1_SPI0D Mask */

#define MXC_F_GCR_PERCKCN1_SPIXIPDD_POS                20 /**< PERCKCN1_SPIXIPDD Position */
#define MXC_F_GCR_PERCKCN1_SPIXIPDD                    ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_SPIXIPDD_POS)) /**< PERCKCN1_SPIXIPDD Mask */

#define MXC_F_GCR_PERCKCN1_DMA1D_POS                   21 /**< PERCKCN1_DMA1D Position */
#define MXC_F_GCR_PERCKCN1_DMA1D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_DMA1D_POS)) /**< PERCKCN1_DMA1D Mask */

#define MXC_F_GCR_PERCKCN1_AUDIOD_POS                  23 /**< PERCKCN1_AUDIOD Position */
#define MXC_F_GCR_PERCKCN1_AUDIOD                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_AUDIOD_POS)) /**< PERCKCN1_AUDIOD Mask */

#define MXC_F_GCR_PERCKCN1_I2C2D_POS                   24 /**< PERCKCN1_I2C2D Position */
#define MXC_F_GCR_PERCKCN1_I2C2D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_I2C2D_POS)) /**< PERCKCN1_I2C2D Mask */

#define MXC_F_GCR_PERCKCN1_HTMR0D_POS                  25 /**< PERCKCN1_HTMR0D Position */
#define MXC_F_GCR_PERCKCN1_HTMR0D                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_HTMR0D_POS)) /**< PERCKCN1_HTMR0D Mask */

#define MXC_F_GCR_PERCKCN1_HTMR1D_POS                  26 /**< PERCKCN1_HTMR1D Position */
#define MXC_F_GCR_PERCKCN1_HTMR1D                      ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_HTMR1D_POS)) /**< PERCKCN1_HTMR1D Mask */

#define MXC_F_GCR_PERCKCN1_WDT0D_POS                   27 /**< PERCKCN1_WDT0D Position */
#define MXC_F_GCR_PERCKCN1_WDT0D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_WDT0D_POS)) /**< PERCKCN1_WDT0D Mask */

#define MXC_F_GCR_PERCKCN1_WDT1D_POS                   28 /**< PERCKCN1_WDT1D Position */
#define MXC_F_GCR_PERCKCN1_WDT1D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_WDT1D_POS)) /**< PERCKCN1_WDT1D Mask */

#define MXC_F_GCR_PERCKCN1_WDT2D_POS                   29 /**< PERCKCN1_WDT2D Position */
#define MXC_F_GCR_PERCKCN1_WDT2D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_WDT2D_POS)) /**< PERCKCN1_WDT2D Mask */

#define MXC_F_GCR_PERCKCN1_CPU1D_POS                   31 /**< PERCKCN1_CPU1D Position */
#define MXC_F_GCR_PERCKCN1_CPU1D                       ((uint32_t)(0x1UL << MXC_F_GCR_PERCKCN1_CPU1D_POS)) /**< PERCKCN1_CPU1D Mask */

