analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/gcr_regs.h
/**@} end of group GCR_PERCKCN1_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_EVENT_EN GCR_EVENT_EN
 * @brief    Event Enable Register.
 * @{
 */
#define MXC_F_GCR_EVENT_EN_CPU0DMAEVENT_POS            0 /**< EVENT_EN_CPU0DMAEVENT Position */
#define MXC_F_GCR_EVENT_EN_CPU0DMAEVENT                ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_CPU0DMAEVENT_POS)) /**< EVENT_EN_CPU0DMAEVENT Mask */

#define MXC_F_GCR_EVENT_EN_CPU0DMA1EVENT_POS           1 /**< EVENT_EN_CPU0DMA1EVENT Position */
#define MXC_F_GCR_EVENT_EN_CPU0DMA1EVENT               ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_CPU0DMA1EVENT_POS)) /**< EVENT_EN_CPU0DMA1EVENT Mask */

#define MXC_F_GCR_EVENT_EN_CPU0TXEVENT_POS             2 /**< EVENT_EN_CPU0TXEVENT Position */
#define MXC_F_GCR_EVENT_EN_CPU0TXEVENT                 ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_CPU0TXEVENT_POS)) /**< EVENT_EN_CPU0TXEVENT Mask */

#define MXC_F_GCR_EVENT_EN_CPU1DMAEVENT_POS            3 /**< EVENT_EN_CPU1DMAEVENT Position */
#define MXC_F_GCR_EVENT_EN_CPU1DMAEVENT                ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_CPU1DMAEVENT_POS)) /**< EVENT_EN_CPU1DMAEVENT Mask */

#define MXC_F_GCR_EVENT_EN_CPU1DMA1EVENT_POS           4 /**< EVENT_EN_CPU1DMA1EVENT Position */
#define MXC_F_GCR_EVENT_EN_CPU1DMA1EVENT               ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_CPU1DMA1EVENT_POS)) /**< EVENT_EN_CPU1DMA1EVENT Mask */

#define MXC_F_GCR_EVENT_EN_CPU1TXEVENT_POS             5 /**< EVENT_EN_CPU1TXEVENT Position */
#define MXC_F_GCR_EVENT_EN_CPU1TXEVENT                 ((uint32_t)(0x1UL << MXC_F_GCR_EVENT_EN_CPU1TXEVENT_POS)) /**< EVENT_EN_CPU1TXEVENT Mask */

/**@} end of group GCR_EVENT_EN_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_REVISION GCR_REVISION
 * @brief    Revision Register.
 * @{
 */
#define MXC_F_GCR_REVISION_REVISION_POS                0 /**< REVISION_REVISION Position */
#define MXC_F_GCR_REVISION_REVISION                    ((uint32_t)(0xFFFFUL << MXC_F_GCR_REVISION_REVISION_POS)) /**< REVISION_REVISION Mask */

/**@} end of group GCR_REVISION_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_SYSSIE GCR_SYSSIE
 * @brief    System Status Interrupt Enable Register.
 * @{
 */
#define MXC_F_GCR_SYSSIE_ICEULIE_POS                   0 /**< SYSSIE_ICEULIE Position */
#define MXC_F_GCR_SYSSIE_ICEULIE                       ((uint32_t)(0x1UL << MXC_F_GCR_SYSSIE_ICEULIE_POS)) /**< SYSSIE_ICEULIE Mask */

#define MXC_F_GCR_SYSSIE_CIEIE_POS                     1 /**< SYSSIE_CIEIE Position */
#define MXC_F_GCR_SYSSIE_CIEIE                         ((uint32_t)(0x1UL << MXC_F_GCR_SYSSIE_CIEIE_POS)) /**< SYSSIE_CIEIE Mask */

#define MXC_F_GCR_SYSSIE_SCMFIE_POS                    5 /**< SYSSIE_SCMFIE Position */
#define MXC_F_GCR_SYSSIE_SCMFIE                        ((uint32_t)(0x1UL << MXC_F_GCR_SYSSIE_SCMFIE_POS)) /**< SYSSIE_SCMFIE Mask */

/**@} end of group GCR_SYSSIE_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECC_ER GCR_ECC_ER
 * @brief    ECC Error Register
 * @{
 */
#define MXC_F_GCR_ECC_ER_SYSRAM0ECCERR_POS             0 /**< ECC_ER_SYSRAM0ECCERR Position */
#define MXC_F_GCR_ECC_ER_SYSRAM0ECCERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_SYSRAM0ECCERR_POS)) /**< ECC_ER_SYSRAM0ECCERR Mask */

#define MXC_F_GCR_ECC_ER_SYSRAM1ECCERR_POS             1 /**< ECC_ER_SYSRAM1ECCERR Position */
#define MXC_F_GCR_ECC_ER_SYSRAM1ECCERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_SYSRAM1ECCERR_POS)) /**< ECC_ER_SYSRAM1ECCERR Mask */

#define MXC_F_GCR_ECC_ER_SYSRAM2ECCERR_POS             2 /**< ECC_ER_SYSRAM2ECCERR Position */
#define MXC_F_GCR_ECC_ER_SYSRAM2ECCERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_SYSRAM2ECCERR_POS)) /**< ECC_ER_SYSRAM2ECCERR Mask */

#define MXC_F_GCR_ECC_ER_SYSRAM3ECCERR_POS             3 /**< ECC_ER_SYSRAM3ECCERR Position */
#define MXC_F_GCR_ECC_ER_SYSRAM3ECCERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_SYSRAM3ECCERR_POS)) /**< ECC_ER_SYSRAM3ECCERR Mask */

#define MXC_F_GCR_ECC_ER_SYSRAM4ECCERR_POS             4 /**< ECC_ER_SYSRAM4ECCERR Position */
#define MXC_F_GCR_ECC_ER_SYSRAM4ECCERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_SYSRAM4ECCERR_POS)) /**< ECC_ER_SYSRAM4ECCERR Mask */

#define MXC_F_GCR_ECC_ER_SYSRAM5ECCERR_POS             5 /**< ECC_ER_SYSRAM5ECCERR Position */
#define MXC_F_GCR_ECC_ER_SYSRAM5ECCERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_SYSRAM5ECCERR_POS)) /**< ECC_ER_SYSRAM5ECCERR Mask */

#define MXC_F_GCR_ECC_ER_SYSRAM6ECCERR_POS             6 /**< ECC_ER_SYSRAM6ECCERR Position */
#define MXC_F_GCR_ECC_ER_SYSRAM6ECCERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_SYSRAM6ECCERR_POS)) /**< ECC_ER_SYSRAM6ECCERR Mask */

#define MXC_F_GCR_ECC_ER_IC0ECCERR_POS                 8 /**< ECC_ER_IC0ECCERR Position */
#define MXC_F_GCR_ECC_ER_IC0ECCERR                     ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_IC0ECCERR_POS)) /**< ECC_ER_IC0ECCERR Mask */

#define MXC_F_GCR_ECC_ER_IC1ECCERR_POS                 9 /**< ECC_ER_IC1ECCERR Position */
#define MXC_F_GCR_ECC_ER_IC1ECCERR                     ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_IC1ECCERR_POS)) /**< ECC_ER_IC1ECCERR Mask */

#define MXC_F_GCR_ECC_ER_ICXIPECCERR_POS               10 /**< ECC_ER_ICXIPECCERR Position */
#define MXC_F_GCR_ECC_ER_ICXIPECCERR                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_ICXIPECCERR_POS)) /**< ECC_ER_ICXIPECCERR Mask */

#define MXC_F_GCR_ECC_ER_FL0ECCERR_POS                 11 /**< ECC_ER_FL0ECCERR Position */
#define MXC_F_GCR_ECC_ER_FL0ECCERR                     ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_FL0ECCERR_POS)) /**< ECC_ER_FL0ECCERR Mask */

#define MXC_F_GCR_ECC_ER_FL1ECCERR_POS                 12 /**< ECC_ER_FL1ECCERR Position */
#define MXC_F_GCR_ECC_ER_FL1ECCERR                     ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ER_FL1ECCERR_POS)) /**< ECC_ER_FL1ECCERR Mask */

/**@} end of group GCR_ECC_ER_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECC_CED GCR_ECC_CED
 * @brief    ECC Correctable Error Detected Register
 * @{
 */
#define MXC_F_GCR_ECC_CED_SYSRAM0ECCNDED_POS           0 /**< ECC_CED_SYSRAM0ECCNDED Position */
#define MXC_F_GCR_ECC_CED_SYSRAM0ECCNDED               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_SYSRAM0ECCNDED_POS)) /**< ECC_CED_SYSRAM0ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_SYSRAM1ECCNDED_POS           1 /**< ECC_CED_SYSRAM1ECCNDED Position */
#define MXC_F_GCR_ECC_CED_SYSRAM1ECCNDED               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_SYSRAM1ECCNDED_POS)) /**< ECC_CED_SYSRAM1ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_SYSRAM2ECCNDED_POS           2 /**< ECC_CED_SYSRAM2ECCNDED Position */
#define MXC_F_GCR_ECC_CED_SYSRAM2ECCNDED               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_SYSRAM2ECCNDED_POS)) /**< ECC_CED_SYSRAM2ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_SYSRAM3ECCNDED_POS           3 /**< ECC_CED_SYSRAM3ECCNDED Position */
#define MXC_F_GCR_ECC_CED_SYSRAM3ECCNDED               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_SYSRAM3ECCNDED_POS)) /**< ECC_CED_SYSRAM3ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_SYSRAM4ECCNDED_POS           4 /**< ECC_CED_SYSRAM4ECCNDED Position */
#define MXC_F_GCR_ECC_CED_SYSRAM4ECCNDED               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_SYSRAM4ECCNDED_POS)) /**< ECC_CED_SYSRAM4ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_SYSRAM5ECCNDED_POS           5 /**< ECC_CED_SYSRAM5ECCNDED Position */
#define MXC_F_GCR_ECC_CED_SYSRAM5ECCNDED               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_SYSRAM5ECCNDED_POS)) /**< ECC_CED_SYSRAM5ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_IC0ECCNDED_POS               8 /**< ECC_CED_IC0ECCNDED Position */
#define MXC_F_GCR_ECC_CED_IC0ECCNDED                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_IC0ECCNDED_POS)) /**< ECC_CED_IC0ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_IC1ECCNDED_POS               9 /**< ECC_CED_IC1ECCNDED Position */
#define MXC_F_GCR_ECC_CED_IC1ECCNDED                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_IC1ECCNDED_POS)) /**< ECC_CED_IC1ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_ICXIPECCNDED_POS             10 /**< ECC_CED_ICXIPECCNDED Position */
#define MXC_F_GCR_ECC_CED_ICXIPECCNDED                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_ICXIPECCNDED_POS)) /**< ECC_CED_ICXIPECCNDED Mask */

#define MXC_F_GCR_ECC_CED_FL0ECCNDED_POS               11 /**< ECC_CED_FL0ECCNDED Position */
#define MXC_F_GCR_ECC_CED_FL0ECCNDED                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_FL0ECCNDED_POS)) /**< ECC_CED_FL0ECCNDED Mask */

#define MXC_F_GCR_ECC_CED_FL1ECCNDED_POS               12 /**< ECC_CED_FL1ECCNDED Position */
#define MXC_F_GCR_ECC_CED_FL1ECCNDED                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_CED_FL1ECCNDED_POS)) /**< ECC_CED_FL1ECCNDED Mask */

/**@} end of group GCR_ECC_CED_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECC_IRQEN GCR_ECC_IRQEN
 * @brief    ECC IRQ Enable Register
 * @{
 */
#define MXC_F_GCR_ECC_IRQEN_SYSRAM0ECCEN_POS           0 /**< ECC_IRQEN_SYSRAM0ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_SYSRAM0ECCEN               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_SYSRAM0ECCEN_POS)) /**< ECC_IRQEN_SYSRAM0ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_SYSRAM1ECCEN_POS           1 /**< ECC_IRQEN_SYSRAM1ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_SYSRAM1ECCEN               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_SYSRAM1ECCEN_POS)) /**< ECC_IRQEN_SYSRAM1ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_SYSRAM2ECCEN_POS           2 /**< ECC_IRQEN_SYSRAM2ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_SYSRAM2ECCEN               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_SYSRAM2ECCEN_POS)) /**< ECC_IRQEN_SYSRAM2ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_SYSRAM3ECCEN_POS           3 /**< ECC_IRQEN_SYSRAM3ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_SYSRAM3ECCEN               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_SYSRAM3ECCEN_POS)) /**< ECC_IRQEN_SYSRAM3ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_SYSRAM4ECCEN_POS           4 /**< ECC_IRQEN_SYSRAM4ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_SYSRAM4ECCEN               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_SYSRAM4ECCEN_POS)) /**< ECC_IRQEN_SYSRAM4ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_SYSRAM5ECCEN_POS           5 /**< ECC_IRQEN_SYSRAM5ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_SYSRAM5ECCEN               ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_SYSRAM5ECCEN_POS)) /**< ECC_IRQEN_SYSRAM5ECCEN Mask */

