analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/gcr_regs.h
#define MXC_F_GCR_ECC_IRQEN_IC0ECCEN_POS               8 /**< ECC_IRQEN_IC0ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_IC0ECCEN                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_IC0ECCEN_POS)) /**< ECC_IRQEN_IC0ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_IC1ECCEN_POS               9 /**< ECC_IRQEN_IC1ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_IC1ECCEN                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_IC1ECCEN_POS)) /**< ECC_IRQEN_IC1ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_ICXIPECCEN_POS             10 /**< ECC_IRQEN_ICXIPECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_ICXIPECCEN                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_ICXIPECCEN_POS)) /**< ECC_IRQEN_ICXIPECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_FL0ECCEN_POS               11 /**< ECC_IRQEN_FL0ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_FL0ECCEN                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_FL0ECCEN_POS)) /**< ECC_IRQEN_FL0ECCEN Mask */

#define MXC_F_GCR_ECC_IRQEN_FL1ECCEN_POS               12 /**< ECC_IRQEN_FL1ECCEN Position */
#define MXC_F_GCR_ECC_IRQEN_FL1ECCEN                   ((uint32_t)(0x1UL << MXC_F_GCR_ECC_IRQEN_FL1ECCEN_POS)) /**< ECC_IRQEN_FL1ECCEN Mask */

/**@} end of group GCR_ECC_IRQEN_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECC_ERRAD GCR_ECC_ERRAD
 * @brief    ECC Error Address Register
 * @{
 */
#define MXC_F_GCR_ECC_ERRAD_DATARAMADDR_POS            0 /**< ECC_ERRAD_DATARAMADDR Position */
#define MXC_F_GCR_ECC_ERRAD_DATARAMADDR                ((uint32_t)(0x1FFFUL << MXC_F_GCR_ECC_ERRAD_DATARAMADDR_POS)) /**< ECC_ERRAD_DATARAMADDR Mask */

#define MXC_F_GCR_ECC_ERRAD_DATARAMBANK_POS            14 /**< ECC_ERRAD_DATARAMBANK Position */
#define MXC_F_GCR_ECC_ERRAD_DATARAMBANK                ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ERRAD_DATARAMBANK_POS)) /**< ECC_ERRAD_DATARAMBANK Mask */

#define MXC_F_GCR_ECC_ERRAD_DATARAMERR_POS             15 /**< ECC_ERRAD_DATARAMERR Position */
#define MXC_F_GCR_ECC_ERRAD_DATARAMERR                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ERRAD_DATARAMERR_POS)) /**< ECC_ERRAD_DATARAMERR Mask */

#define MXC_F_GCR_ECC_ERRAD_TAGRAMADDR_POS             16 /**< ECC_ERRAD_TAGRAMADDR Position */
#define MXC_F_GCR_ECC_ERRAD_TAGRAMADDR                 ((uint32_t)(0x1FFFUL << MXC_F_GCR_ECC_ERRAD_TAGRAMADDR_POS)) /**< ECC_ERRAD_TAGRAMADDR Mask */

#define MXC_F_GCR_ECC_ERRAD_TAGRAMBANK_POS             30 /**< ECC_ERRAD_TAGRAMBANK Position */
#define MXC_F_GCR_ECC_ERRAD_TAGRAMBANK                 ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ERRAD_TAGRAMBANK_POS)) /**< ECC_ERRAD_TAGRAMBANK Mask */

#define MXC_F_GCR_ECC_ERRAD_TAGRAMERR_POS              31 /**< ECC_ERRAD_TAGRAMERR Position */
#define MXC_F_GCR_ECC_ERRAD_TAGRAMERR                  ((uint32_t)(0x1UL << MXC_F_GCR_ECC_ERRAD_TAGRAMERR_POS)) /**< ECC_ERRAD_TAGRAMERR Mask */

/**@} end of group GCR_ECC_ERRAD_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLE_LDOCR GCR_BTLE_LDOCR
 * @brief    BTLE LDO Control Register
 * @{
 */
#define MXC_F_GCR_BTLE_LDOCR_LDORXEN_POS               0 /**< BTLE_LDOCR_LDORXEN Position */
#define MXC_F_GCR_BTLE_LDOCR_LDORXEN                   ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDORXEN_POS)) /**< BTLE_LDOCR_LDORXEN Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDORXOPULLD_POS           1 /**< BTLE_LDOCR_LDORXOPULLD Position */
#define MXC_F_GCR_BTLE_LDOCR_LDORXOPULLD               ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDORXOPULLD_POS)) /**< BTLE_LDOCR_LDORXOPULLD Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDORXVSEL_POS             2 /**< BTLE_LDOCR_LDORXVSEL Position */
#define MXC_F_GCR_BTLE_LDOCR_LDORXVSEL                 ((uint32_t)(0x3UL << MXC_F_GCR_BTLE_LDOCR_LDORXVSEL_POS)) /**< BTLE_LDOCR_LDORXVSEL Mask */
#define MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_0_85            ((uint32_t)0x0UL) /**< BTLE_LDOCR_LDORXVSEL_0_85 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDORXVSEL_0_85            (MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_0_85 << MXC_F_GCR_BTLE_LDOCR_LDORXVSEL_POS) /**< BTLE_LDOCR_LDORXVSEL_0_85 Setting */
#define MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_0_9             ((uint32_t)0x1UL) /**< BTLE_LDOCR_LDORXVSEL_0_9 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDORXVSEL_0_9             (MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_0_9 << MXC_F_GCR_BTLE_LDOCR_LDORXVSEL_POS) /**< BTLE_LDOCR_LDORXVSEL_0_9 Setting */
#define MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_1_0             ((uint32_t)0x2UL) /**< BTLE_LDOCR_LDORXVSEL_1_0 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDORXVSEL_1_0             (MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_1_0 << MXC_F_GCR_BTLE_LDOCR_LDORXVSEL_POS) /**< BTLE_LDOCR_LDORXVSEL_1_0 Setting */
#define MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_1_1             ((uint32_t)0x3UL) /**< BTLE_LDOCR_LDORXVSEL_1_1 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDORXVSEL_1_1             (MXC_V_GCR_BTLE_LDOCR_LDORXVSEL_1_1 << MXC_F_GCR_BTLE_LDOCR_LDORXVSEL_POS) /**< BTLE_LDOCR_LDORXVSEL_1_1 Setting */

#define MXC_F_GCR_BTLE_LDOCR_LDOTXEN_POS               4 /**< BTLE_LDOCR_LDOTXEN Position */
#define MXC_F_GCR_BTLE_LDOCR_LDOTXEN                   ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDOTXEN_POS)) /**< BTLE_LDOCR_LDOTXEN Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDOTXPULLD_POS            5 /**< BTLE_LDOCR_LDOTXPULLD Position */
#define MXC_F_GCR_BTLE_LDOCR_LDOTXPULLD                ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDOTXPULLD_POS)) /**< BTLE_LDOCR_LDOTXPULLD Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDOTXVSEL_POS             6 /**< BTLE_LDOCR_LDOTXVSEL Position */
#define MXC_F_GCR_BTLE_LDOCR_LDOTXVSEL                 ((uint32_t)(0x3UL << MXC_F_GCR_BTLE_LDOCR_LDOTXVSEL_POS)) /**< BTLE_LDOCR_LDOTXVSEL Mask */
#define MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_0_85            ((uint32_t)0x0UL) /**< BTLE_LDOCR_LDOTXVSEL_0_85 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDOTXVSEL_0_85            (MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_0_85 << MXC_F_GCR_BTLE_LDOCR_LDOTXVSEL_POS) /**< BTLE_LDOCR_LDOTXVSEL_0_85 Setting */
#define MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_0_9             ((uint32_t)0x1UL) /**< BTLE_LDOCR_LDOTXVSEL_0_9 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDOTXVSEL_0_9             (MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_0_9 << MXC_F_GCR_BTLE_LDOCR_LDOTXVSEL_POS) /**< BTLE_LDOCR_LDOTXVSEL_0_9 Setting */
#define MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_1_0             ((uint32_t)0x2UL) /**< BTLE_LDOCR_LDOTXVSEL_1_0 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDOTXVSEL_1_0             (MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_1_0 << MXC_F_GCR_BTLE_LDOCR_LDOTXVSEL_POS) /**< BTLE_LDOCR_LDOTXVSEL_1_0 Setting */
#define MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_1_1             ((uint32_t)0x3UL) /**< BTLE_LDOCR_LDOTXVSEL_1_1 Value */
#define MXC_S_GCR_BTLE_LDOCR_LDOTXVSEL_1_1             (MXC_V_GCR_BTLE_LDOCR_LDOTXVSEL_1_1 << MXC_F_GCR_BTLE_LDOCR_LDOTXVSEL_POS) /**< BTLE_LDOCR_LDOTXVSEL_1_1 Setting */

