analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/gcr_regs.h
#define MXC_F_GCR_BTLE_LDOCR_LDOTXBYP_POS              8 /**< BTLE_LDOCR_LDOTXBYP Position */
#define MXC_F_GCR_BTLE_LDOCR_LDOTXBYP                  ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDOTXBYP_POS)) /**< BTLE_LDOCR_LDOTXBYP Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDOTXDISCH_POS            9 /**< BTLE_LDOCR_LDOTXDISCH Position */
#define MXC_F_GCR_BTLE_LDOCR_LDOTXDISCH                ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDOTXDISCH_POS)) /**< BTLE_LDOCR_LDOTXDISCH Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDORXBYP_POS              10 /**< BTLE_LDOCR_LDORXBYP Position */
#define MXC_F_GCR_BTLE_LDOCR_LDORXBYP                  ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDORXBYP_POS)) /**< BTLE_LDOCR_LDORXBYP Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDORXDISCH_POS            11 /**< BTLE_LDOCR_LDORXDISCH Position */
#define MXC_F_GCR_BTLE_LDOCR_LDORXDISCH                ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDORXDISCH_POS)) /**< BTLE_LDOCR_LDORXDISCH Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDORXENDLY_POS            12 /**< BTLE_LDOCR_LDORXENDLY Position */
#define MXC_F_GCR_BTLE_LDOCR_LDORXENDLY                ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDORXENDLY_POS)) /**< BTLE_LDOCR_LDORXENDLY Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDOTXENDLY_POS            13 /**< BTLE_LDOCR_LDOTXENDLY Position */
#define MXC_F_GCR_BTLE_LDOCR_LDOTXENDLY                ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDOTXENDLY_POS)) /**< BTLE_LDOCR_LDOTXENDLY Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDOTXBYPENENDLY_POS       14 /**< BTLE_LDOCR_LDOTXBYPENENDLY Position */
#define MXC_F_GCR_BTLE_LDOCR_LDOTXBYPENENDLY           ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDOTXBYPENENDLY_POS)) /**< BTLE_LDOCR_LDOTXBYPENENDLY Mask */

#define MXC_F_GCR_BTLE_LDOCR_LDORXBYPENENDLY_POS       15 /**< BTLE_LDOCR_LDORXBYPENENDLY Position */
#define MXC_F_GCR_BTLE_LDOCR_LDORXBYPENENDLY           ((uint32_t)(0x1UL << MXC_F_GCR_BTLE_LDOCR_LDORXBYPENENDLY_POS)) /**< BTLE_LDOCR_LDORXBYPENENDLY Mask */

/**@} end of group GCR_BTLE_LDOCR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLE_LDODCR GCR_BTLE_LDODCR
 * @brief    BTLE LDO Delay Register
 * @{
 */
#define MXC_F_GCR_BTLE_LDODCR_BYPDLYCNT_POS            0 /**< BTLE_LDODCR_BYPDLYCNT Position */
#define MXC_F_GCR_BTLE_LDODCR_BYPDLYCNT                ((uint32_t)(0xFFUL << MXC_F_GCR_BTLE_LDODCR_BYPDLYCNT_POS)) /**< BTLE_LDODCR_BYPDLYCNT Mask */

#define MXC_F_GCR_BTLE_LDODCR_LDOTXDLYCNT_POS          8 /**< BTLE_LDODCR_LDOTXDLYCNT Position */
#define MXC_F_GCR_BTLE_LDODCR_LDOTXDLYCNT              ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLE_LDODCR_LDOTXDLYCNT_POS)) /**< BTLE_LDODCR_LDOTXDLYCNT Mask */

#define MXC_F_GCR_BTLE_LDODCR_LDORXDLYCNT_POS          20 /**< BTLE_LDODCR_LDORXDLYCNT Position */
#define MXC_F_GCR_BTLE_LDODCR_LDORXDLYCNT              ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLE_LDODCR_LDORXDLYCNT_POS)) /**< BTLE_LDODCR_LDORXDLYCNT Mask */

/**@} end of group GCR_BTLE_LDODCR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_GP0 GCR_GP0
 * @brief    General Purpose Register 0
 * @{
 */
#define MXC_F_GCR_GP0_GPR0_POS                         0 /**< GP0_GPR0 Position */
#define MXC_F_GCR_GP0_GPR0                             ((uint32_t)(0xFFFFFFFFUL << MXC_F_GCR_GP0_GPR0_POS)) /**< GP0_GPR0 Mask */

/**@} end of group GCR_GP0_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_APB_ASYNC GCR_APB_ASYNC
 * @brief    APB Asynchronous Bridge Select Register
 * @{
 */
#define MXC_F_GCR_APB_ASYNC_APBASYNCI2C0_POS           0 /**< APB_ASYNC_APBASYNCI2C0 Position */
#define MXC_F_GCR_APB_ASYNC_APBASYNCI2C0               ((uint32_t)(0x1UL << MXC_F_GCR_APB_ASYNC_APBASYNCI2C0_POS)) /**< APB_ASYNC_APBASYNCI2C0 Mask */

#define MXC_F_GCR_APB_ASYNC_APBASYNCI2C1_POS           1 /**< APB_ASYNC_APBASYNCI2C1 Position */
#define MXC_F_GCR_APB_ASYNC_APBASYNCI2C1               ((uint32_t)(0x1UL << MXC_F_GCR_APB_ASYNC_APBASYNCI2C1_POS)) /**< APB_ASYNC_APBASYNCI2C1 Mask */

#define MXC_F_GCR_APB_ASYNC_APBASYNCI2C2_POS           2 /**< APB_ASYNC_APBASYNCI2C2 Position */
#define MXC_F_GCR_APB_ASYNC_APBASYNCI2C2               ((uint32_t)(0x1UL << MXC_F_GCR_APB_ASYNC_APBASYNCI2C2_POS)) /**< APB_ASYNC_APBASYNCI2C2 Mask */

#define MXC_F_GCR_APB_ASYNC_APBASYNCPT_POS             3 /**< APB_ASYNC_APBASYNCPT Position */
#define MXC_F_GCR_APB_ASYNC_APBASYNCPT                 ((uint32_t)(0x1UL << MXC_F_GCR_APB_ASYNC_APBASYNCPT_POS)) /**< APB_ASYNC_APBASYNCPT Mask */

/**@} end of group GCR_APB_ASYNC_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32665_INCLUDE_GCR_REGS_H_
